{
  "Posts": [
    {
      "id": 1,
      "title": "Grand Theft Auto V",
      "image": "https://img.gta5-mods.com/q95/images/nuke-bomb-mod-better-car-explosion/adc1b5-20161028172046_1.jpg",
      "date": "2018/07/18",
      "content": "Michael Townley, Trevor Philips, and Brad Snider partake in a botched robbery in Ludendorff, North Yankton. Nine years later, Michael is living under witness protection with his family in Los Santos, under the alias Michael De Santa. Across town, gangbanger Franklin Clinton is working for a corrupt Armenian car salesman and meets Michael while attempting to fraudulently repossess his son's car; the two later become friends. When Michael finds his wife Amanda sleeping with her tennis coach, he and Franklin chase the coach to a mansion, which Michael destroys in anger. The owner turns out to be the girlfriend of Martin Madrazo, a Mexican drug lord who demands compensation to avoid further violence. Michael returns to a life of crime to obtain the money, enlisting Franklin as an accomplice. With the help of Michael's old friend Lester, a crippled hacker, they perform a jewellery shop heist to pay off the debt. Trevor, who now lives in a trailer park on the outskirts of Los Santos and believes Michael was killed in their failed robbery, hears of the heist and realises that it was Michael's handiwork. Trevor surprises Michael and reunites with him, after tracking down his home. In time, the personal lives of the protagonists begin to spiral out of control. Michael's increasingly erratic behaviour prompts his family to leave him. When he becomes a movie producer at film studio Richards Majestic, Michael comes into conflict with Devin Weston, a self-made billionaire venture capitalist and corporate raider, who vows revenge after his attempts to shut down the studio are thwarted by him. Franklin, meanwhile, rescues his friend Lamar Davis from gangster and former friend Harold 'Stretch' Joseph, who repeatedly attempts to kill Lamar to prove himself to his new brethren. At the same time, Trevor's reckless efforts to consolidate his control over various black markets in Blaine County see him waging war against The Lost outlaw motorcycle club, several Latin American street gangs, rival meth dealers, hillbillies, private security firm Merryweather, and Triad kingpin Wei Cheng. Federal Investigation Bureau (FIB) agents Dave Norton and Steve Haines contact Michael and demand that he perform a series of operations to undermine a rival agency, the International Affairs Agency (IAA).[i] Under Steve's direction and with Lester's help, they attack an armoured convoy carrying funds intended for the IAA, and steal an experimental chemical weapon from an IAA-controlled lab. As Steve comes under increasing scrutiny, he forces Michael and Franklin to erase any evidence being used against him from the FIB servers. Michael takes the opportunity to wipe the data on his own activities, destroying Steve's leverage over him. Eventually, Michael, Trevor, Franklin, and Lester start planning their most daring feat ever: raiding the Union Depository's gold bullion reserve. By this time, Michael reconciles with his family. However, Trevor discovers that Brad was not imprisoned as led to believe, but killed during the Ludendorff heist and buried in the grave marked for Michael. Trevor's feelings of betrayal cause friction within the group and threaten to undermine their Union Depository plans. When Michael and Dave are betrayed by Steve and become caught in a Mexican standoff between the FIB, IAA, and Merryweather, Trevor, feeling that he is the only one that has the right to kill Michael, comes to their aid. Despite not forgiving Michael, Trevor agrees to perform the Union Depository heist and part ways with him afterwards. The heist is completed successfully, but Franklin is then approached separately by Steve and Dave, who contend that Trevor is a liability, and Devin, who wants retribution for Michael's betrayal. Franklin has three choices: kill Trevor, kill Michael, or attempt to save both in a suicide mission. Should Franklin choose to kill either Michael or Trevor, he ceases contact with the man he spares and returns to his old life.[30][31] Otherwise, the trio withstands an onslaught from the FIB and Merryweather before going on to kill Steve, Stretch, Wei, and Devin. Michael and Trevor reconcile, and the three cease working together but remain friends.[32]",
      "author": "Miguel Jacobs"
    },
    {
      "id": 2,
      "title": "Dark Souls III",
      "image": "https://www.instant-gaming.com/images/products/857/screenshot/857-1.jpg",
      "date": "2018/07/18",
      "content": "Set in the Kingdom of Lothric, a bell has rung to signal that the First Flame, responsible for maintaining the Age of Fire, is dying out. As has happened many times before, the coming of the Age of Dark produces the undead: cursed beings that rise up after death. The Age of Fire can be prolonged with the linking of the fires, a ritual in which great lords and heroes sacrifice their souls to rekindle the First Flame. However, Prince Lothric, the chosen linker for this age, has abandoned his duty and instead chooses to watch the flame die from afar. The bell is the last hope for the Age of Fire, resurrecting previous Lords of Cinder (heroes who linked the flame in past ages) to attempt to link the fire again, however all but one Lord shirk their duty. The Ashen One, an Undead who failed to become a Lord of Cinder called an Unkindled, rises and must link the fire by returning Prince Lothric and the defiant Lords of Cinder to their thrones in the Firelink Shrine. The Lords include the Abyss Watchers, a legion of warriors sworn to protect the land from the Abyss and linked by a single soul; Yhorm the Giant, who was once a conqueror of the very people for whom he then sacrificed his life; and Saint Aldrich of the Deep, who became a Lord of Cinder despite his ravenous appetite for both men and gods. Lothric himself was raised in order to link the First Flame, but rejected his destiny, leaving the task to his elder brother Lorian, who was crippled and driven mad as a result of the ritual. Once the Ashen One succeeds in returning Lothric and the Lords of Cinder to their thrones, they travel to the ruins of the Kiln of the First Flame. There, they encounter the Soul of Cinder, an amalgamation of all the previous Lords of Cinder who had linked the flame in the past. Once the Soul of Cinder is defeated, four endings are made possible based on the player's actions during the game. The player can attempt to link the fire, summon the Fire Keeper to extinguish the flame and begin an age of Dark or kill her. A fourth ending consists of the Ashen One taking the flame for their own and becoming the Dark Lord of Londor.",
      "author": "Miguel Jacobs"
    },
    {
      "id": 3,
      "title": "DoTA 2",
      "image": "https://s2-ssl.dmcdn.net/KY5_G/x720-A5K.jpg",
      "date": "2018/07/18",
      "content": "Dota 2 is a multiplayer online battle arena (MOBA) video game in which two teams of five players compete to collectively destroy a large structure defended by the opposing team known as the 'Ancient', whilst defending their own.[1][2] As in Defense of the Ancients, the game is controlled using standard real-time strategy controls, and is presented on a single map in a three-dimensional isometric perspective.[1][3] Ten players each control one of the game's 115 playable characters, known as 'heroes', with each having their own design, strengths, and weaknesses.[1][2][4] Heroes are divided into two primary roles, known as the 'carry' and 'support'.[5] Carries, which are also called 'cores', begin each match as weak and vulnerable, but are able to become more powerful later in the game, thus becoming able to 'carry' their team to victory.[6][5] Supports generally lack abilities that deal heavy damage, instead having ones with more functionality and utility that provide assistance for their carries.[7][5] Players select their hero during a pre-game drafting phase, where they can also discuss potential strategies and hero matchups with their teammates.[2][5] Heroes can not be switched mid-game, and once one is selected, they are removed from the drafting pool and become unavailable for all other players. All heroes have a basic damage-dealing attack, in addition to powerful abilities. Each hero has at least four abilities, all of which are unique, which are the primary method of fighting.[3][7] Heroes begin each game with an experience level of one, only having access to one of their abilities, but are able to level up and become more powerful during the course of the game, up to a maximum level of 25.[2][5] Whenever a hero gains an experience level, the player is able to unlock another of their abilities or improve one already learned.[2][5] The most powerful ability for each hero is known as their 'ultimate', which requires them to have an experience level of six in order to use. In order to prevent abilities from being used without consequence, a magic system in the game exists. Activating an ability costs a hero some of their 'mana points', which slowly regenerates over time.[3][8] Using an ability will also cause it to enter a cooldown phase, in which the ability can not be used again until a timer counts down to zero. All heroes have three attributes: strength, intelligence, and agility, which affect health points, mana points, and attack speed, respectively.[5] Each hero has one primary attribute out of the three, which adds to their non-ability basic damage output when increased.[9][5] Heroes also have an ability augmentation system known as 'Talent Trees', which allow players further choices on how to develop their hero.[10][5] If a hero runs out of health points and dies, they are removed from active play until a respawn timer counts down to zero, where they are then respawned in their base.[11]",
      "author": "Miguel Jacobs"
    },
    {
      "title": "The Witcher 3",
      "image": "https://cdns.kinguin.net/media/category/t/h/the-witcher-3-wild-hunt-debut-gameplay-trailer-1024x576.jpg",
      "date": "2018/6/3",
      "content": "The Witcher 3: Wild Hunt is an action role-playing game with a third-person perspective. Players control Geralt of Rivia, a monster hunter known as a Witcher.[1] Geralt walks, runs, rolls and dodges, and (for the first time in the series) jumps, climbs and swims.[2][3] He has a variety of weapons, including bombs, a crossbow and two swords (one steel and one silver).[4] The steel sword is used primarily to kill humans while the silver sword is more effective against creatures and monsters.[5] Players can draw out, switch and sheathe their swords at will. There are two modes of melee attack; light attacks are fast but weak, and heavy attacks are slow and strong.[6] Players can block and counter enemy attacks with their swords.[4] Swords have limited endurance and require regular repair.[7] In addition to physical attacks, Geralt has five magical signs at his disposal: Aard, Axii, Igni, Yrden and Quen.[8] Aard prompts Geralt to unleash a telekinetic blast, Axii confuses enemies, Igni burns them, Yrden slows them down and Quen offers players a temporary, protective shield.[9] The signs use stamina, and cannot be used indefinitely.[10] Players can use mutagens to increase Geralt's magic power. They lose health when they are attacked by enemies, although wearing armour can help reduce health loss. Health can be restored with meditation or consumables, such as food and potions.[4] Players control Ciri, Geralt's adoptive daughter who can teleport short distances, in certain parts of the game.[11] It has responsive, advanced artificial intelligence (AI) and dynamic environments. The day-night cycle influences some monsters (and their powers), as a werewolf becomes powerful during the night of a full moon.[12] Players can learn about their enemies and prepare for combat by reading the in-game bestiary.[13] When they kill an enemy, they can loot its corpse for valuables.[13] Geralt's witcher sense enables players to find objects of interest, including items that can be collected or scavenged.[14] Items are stored in the inventory, which can be expanded by purchasing upgrades.[13] Players can sell items to vendors[15] or use them to craft potions and bombs.[16][17] They can visit blacksmiths to craft new weapons and armour with what they have gathered.[18] The price of an item and the cost of crafting it depend on a region's local economy.[3]",
      "author": "Miguel Jacobs",
      "id": 4
    },
    {
      "title": "League of Legends",
      "image": "http://apollo-na-uploads.s3.amazonaws.com/1423696351602/LeagueofLegendsZedGlitch.jpg",
      "date": "2018/7/30",
      "content": "League of Legends is a 3D, third-person multiplayer online battle arena (MOBA) game.[13] The game consists of 3 current running game modes: Summoner's Rift, Twisted Treeline, and Howling Abyss.[14] Another game mode, The Crystal Scar, has since been removed.[15] Players compete in matches, lasting anywhere from 20 to 60 minutes on average. In each game mode teams work together to achieve a victory condition, typically destroying the core building (called the Nexus) in the enemy team's base after bypassing a line of defensive structures called turrets, or towers. In all game modes, players control characters called champions, chosen or assigned every match, who each have a set of unique abilities.[16] Champions begin every match at a low level, and then gain experience over the course of the match to achieve a maximum level of 18. Gaining champion levels in matches allows players to unlock their champion's special abilities and augment them in a number of ways unique to each character. If a champion loses all their health, they are defeated, but are automatically revived in their base after enough time passes. Players also begin each match with a low amount of gold, and can earn additional gold throughout the match in a variety of ways: by killing non-player characters known as minions and monsters; by killing or helping to kill enemy players; by destroying enemy structures; passively over time; and through unique item interactions or champion abilities. This gold can then be spent throughout the match to buy in-game items that further augment each champion's abilities and game play in a variety of ways. Champion experience, gold earned, and items bought are specific to each match and do not carry over to subsequent matches. Thus, all players begin each match on more-or-less equal footing relative to their opposing team. Across matches, players also earn rewards that are applied to their account. Player accounts begin at level one and progress onward with games played. Player level is separate from character level; both a level 30 account and a level 5 account would begin at character level 1 at the start of a new game. From 2009–2017, the maximum account level was 30, and as players progressed, they unlocked additional content and abilities. This system was reworked in November 2017, with the removal of the level 30 limit and removal of a Runes / Masteries system that gave progressive bonuses to players based on their account level.[17] Playing matches and leveling up provides 'Blue Essence' (called 'Influence Points' (IP) from 2009–2017), a currency that can be used in lieu of 'real money' to access certain locked features. Accounts are given rankings based on the Elo rating system, with proprietary adjustments.[18] These ratings are used in automated matchmaking to make games with players of comparable skill level on each team.",
      "author": "Miguel Jacobs",
      "id": 5
    },
    {
      "title": "Mass Effect: Andromeda",
      "image": "https://i2.wp.com/gameplaying.info/wp-content/uploads/2017/03/mass-effect-andromeda-gameplay-13-minutes.jpg?ssl=1",
      "date": "2018/7/30",
      "content": "Mass Effect: Andromeda begins in 2185, between the events of Mass Effect 2 and Mass Effect 3.[39][40] The four Citadel Council races and the Quarians are planning to populate new home worlds in the Andromeda Galaxy as part of a strategy called the Andromeda Initiative.[41] Each race sends 20,000 citizens on a one-way, 600-year journey to Andromeda aboard their own transportation vessel, called an Ark, and selects a leader, known as a Pathfinder. Once the races arrive, they help build the Nexus, a space station that serves as a center of government and diplomacy, a living area, as well as a base of operations for the Pathfinders.[42] The protagonist of Mass Effect: Andromeda is, depending on player choice, either Scott or Sara Ryder (voiced by Tom Taylorson or Fryda Wolff, respectively). Their father, Alec Ryder (Clancy Brown), is humanity's Pathfinder, tasked with finding a new home for the species.[37] Squadmates in the game include Alec's second-in-command, Cora Harper (Jules de Jongh), a biotic specialist with intensive commando training; Liam Kosta (Gary Carr), a security expert who specializes in crisis response; Pelessaria 'Peebee' B'Sayle (Christine Lakin), an asari gunslinger capable of biotic destabilization; Nakmor Drack (Stanley Townsend), a veteran krogan warrior of the Nakmor clan specializing in close combat; Vetra Nyx (Danielle Rayne), a female turian mercenary who excels in shielding and protection; and Jaal Ama Darav (Nyasha Hatendi), a resistance fighter of the newly introduced angara race.[43] Ryder's crewmates include Kallo Jath (Garett Ross), a salarian pilot; Suvi Anwar (Katy Townsend), a human science officer; Gil Brodie (Gethin Anthony,[44]), a human mechanic; Lexi T'Perro (Natalie Dormer), an asari medical doctor;[45] and SAM (Alexia Traverse-Healy), an artificial intelligence that can communicate with all members of the team via implants.[46]",
      "author": "Miguel Jacobs",
      "id": 6
    }
  ],
  "Users": [
    {
      "id": 1,
      "client": "miguelxjacobs",
      "email": "miguel.jacobs@hotmail.com",
      "credentials": "password",
      "loggedIn": false
    },
    {
      "client": "one",
      "email": "one@mail.com",
      "credentials": "123",
      "loggedIn": false,
      "id": 2
    },
    {
      "client": "two",
      "email": "two@mail.com",
      "credentials": "12345",
      "loggedIn": false,
      "id": 3
    },
    {
      "client": "orin",
      "email": "orin@mail.com",
      "credentials": "1234",
      "loggedIn": false,
      "id": 4
    }
  ],
  "Subscribers": [
    {
      "id": 1,
      "email": "miguel.jacobs@hotmail.com"
    }
  ]
}